Revit 2026 API

# ViewNavigationToolSettingsGetHomeCamera Method

---

Gets a copy of the structure containing information about the store Home view orientation.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public HomeCamera GetHomeCamera()
```
```vb
Public Function GetHomeCamera As HomeCamera
```
```cpp
public:
HomeCamera^ GetHomeCamera()
```
```fsharp
member GetHomeCamera : unit -> HomeCamera
```

#### Return Value

HomeCamera A copy of the structure containing information about the store Home view orientation, or  if there is no home view set for this document.

#### Reference

ViewNavigationToolSettings Class

Autodesk.Revit.DB Namespace